&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// При открытии показываем логотип
	АдресЛоготипа = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Логотип");
КонецПроцедуры

&НаКлиенте
Процедура АдресЛоготипаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗагрузитьЛоготип();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЛоготип()
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораЛого", ЭтотОбъект);
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Картинки|*.jpg;*.png";
	НачатьПомещениеФайла(Оповещение, , Диалог, Истина, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЛого(Результат, Адрес, ВыбранноеИмя, Доп) Экспорт
	Если Результат Тогда
		АдресЛоготипа = Адрес;
		Модифицированность = Истина;
		СохранитьЛогоНаСервере(Адрес);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СохранитьЛогоНаСервере(ВременныйАдрес)
	ОбъектОрг = РеквизитФормыВЗначение("Объект");
	Двоичные = ПолучитьИзВременногоХранилища(ВременныйАдрес);
	ОбъектОрг.Логотип = Новый ХранилищеЗначения(Двоичные);
	ОбъектОрг.Записать();
	ЗначениеВРеквизитФормы(ОбъектОрг, "Объект");
КонецПроцедуры